In [ ]:
#Bank: Loan Default Risk Prediction
- Age
- Annual Income
- City 
- Paid on time

In [14]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import PolynomialFeatures

np.random.seed(4)
n_samples = 1000

df = pd.DataFrame({
    'age' : np.random.randint(18,60,n_samples),
    'income' : np.random.randint(20_000, 150_000, n_samples),
    'city' : np.random.choice(['NY', 'Delhi', 'London'], n_samples),
    'default' : np.random.choice([0,1],n_samples,p=[0.85,0.15])
})
df.head()

   age  income    city  default
0   23   23670   Delhi        0
1   19   51717   Delhi        0
2   58  109043      NY        0
3   41   29129   Delhi        0
4   26   38329  London        0

In [15]:
df['num_city'] = df['city'].map({'NY':1, 'Delhi':2, 'London': 3})

In [16]:
df.head()

   age  income    city  default  num_city
0   23   23670   Delhi        0         2
1   19   51717   Delhi        0         2
2   58  109043      NY        0         1
3   41   29129   Delhi        0         2
4   26   38329  London        0         3

In [20]:
#Finding non-linear relationships -> Polynomial Features[Degree 2]
poly = PolynomialFeatures(degree = 2, include_bias = False)
poly_features = poly.fit_transform(df[['age', 'income']])
poly_feature_name = poly.get_feature_names_out(['age','income'])
df_poly = pd.DataFrame(poly_features, columns = poly_feature_name)
df_poly.head()

    age    income   age^2  age income      income^2
0  23.0   23670.0   529.0    544410.0  5.602689e+08
1  19.0   51717.0   361.0    982623.0  2.674648e+09
2  58.0  109043.0  3364.0   6324494.0  1.189038e+10
3  41.0   29129.0  1681.0   1194289.0  8.484986e+08
4  26.0   38329.0   676.0    996554.0  1.469112e+09

In [ ]:
age -> stable job -> health issues
income -> higher -> better ability to repay loans -> bad habits | family responsibilities
=> age, income, [loan..] might not be in a linear relationship
we need to build polynomial features to capture more realistic patterns

In [ ]:
age^2 =>

In [21]:
plt.scatter(df['age'], df['income'], alpha = 0.6)
plt.xlabel("Age")
plt.ylabel("Income")
plt.title("Age Vs income")
plt.show()

NameError: name 'plt' is not defined